; domain
(define (domain kitting-domain)
	(:requirements :action-costs :derived-predicates :equality :fluents :strips :typing)
	(:types 
		EndEffector
		EndEffectorChangingStation
		EndEffectorHolder
		Kit
		KitTray
		LargeBoxWithEmptyKitTrays
		LargeBoxWithKits
		Part
		PartsTray
		Robot
		StockKeepingUnit
		WorkTable)
	(:predicates
		;?part is held by ?endeffector
		(part-has-physicalLocation-refObject-endEffector ?part - Part ?endeffector - EndEffector)

		;?partsTray contains ?part
		(partsVessel-has-part ?partstray - PartsTray ?part - Part)

		;?part has ?sku
		(part-has-skuObject-sku ?part - Part ?stockkeepingunit - StockKeepingUnit)

		;?robot has no end effector
		(robot-has-no-endEffector ?robot - Robot)

		;?endeffector is holding ?kit
		(endEffector-has-heldObject-kit ?endeffector - EndEffector ?kit - Kit)

		;?worktable has nothing on top of it
		(workTable-has-no-objectOnTable ?worktable - WorkTable)

		;?kittray is held by ?endeffector
		(kitTray-has-physicalLocation-refObject-endEffector ?kittray - KitTray ?endeffector - EndEffector)

		;?endeffectorholder is holding ?endeffector
		(endEffectorHolder-has-endEffector ?endeffectorholder - EndEffectorHolder ?endeffector - EndEffector)

		;?endEffector is for handling kit trays that have ?sku
		(endEffector-is-for-kitTraySKU ?endeffector - EndEffector ?stockkeepingunit - StockKeepingUnit)

		;?part is in ?partsTray
		(part-has-physicalLocation-refObject-partsTray ?part - Part ?partstray - PartsTray)

		;?kittray is on ?worktable
		(kitTray-has-physicalLocation-refObject-workTable ?kittray - KitTray ?worktable - WorkTable)

		;?endEffector is for handling parts that have ?sku
		(endEffector-is-for-partSKU ?endeffector - EndEffector ?stockkeepingunit - StockKeepingUnit)

		;?endeffector is located in ?endEffectorHolder
		(endEffector-has-physicalLocation-refObject-endEffectorHolder ?endeffector - EndEffector ?endeffectorholder - EndEffectorHolder)

		;?kit has ?kittray
		(kit-has-kitTray ?kit - Kit ?kittray - KitTray)

		;?lbwk contains ?kit
		(lbwk-has-kit ?largeboxwithkits - LargeBoxWithKits ?kit - Kit)

		;?worktable has ?kit on top of it
		(workTable-has-objectOnTable-kit ?worktable - WorkTable ?kit - Kit)

		;?worktable has ?kitTray on top of it
		(workTable-has-objectOnTable-kitTray ?worktable - WorkTable ?kittray - KitTray)

		;?endeffector is attached to ?robot
		(endEffector-has-physicalLocation-refObject-robot ?endeffector - EndEffector ?robot - Robot)

		;?part is found
		(part-is-found ?part - Part)

		;?kittray is located in ?lbwekt
		(kitTray-has-physicalLocation-refObject-lbwekt ?kittray - KitTray ?largeboxwithemptykittrays - LargeBoxWithEmptyKitTrays)

		;?kit is on ?worktable
		(kit-has-physicalLocation-refObject-workTable ?kit - Kit ?worktable - WorkTable)

		;?kittray has ?sku
		(kitTray-has-skuObject-sku ?kittray - KitTray ?stockkeepingunit - StockKeepingUnit)

		;?changingstation contains ?endeffectorholder
		(endEffectorChangingStation-has-endEffectorHolder ?endeffectorchangingstation - EndEffectorChangingStation ?endeffectorholder - EndEffectorHolder)

		;?kittray is related to ?kit
		(kitTray-has-physicalLocation-refObject-kit ?kittray - KitTray ?kit - Kit)

		;?kit is located in ?lbwk
		(kit-has-physicalLocation-refObject-lbwk ?kit - Kit ?largeboxwithkits - LargeBoxWithKits)

		;?endeffector is not holding any object
		(endEffector-has-no-heldObject ?endeffector - EndEffector)

		;?kit exists
		(kit-exists ?kit - Kit)

		;?part is in ?kit
		(part-has-physicalLocation-refObject-kit ?part - Part ?kit - Kit)

		;?endeffector is holding ?kittray
		(endEffector-has-heldObject-kitTray ?endeffector - EndEffector ?kittray - KitTray)

		;?endeffector is holding ?part
		(endEffector-has-heldObject-part ?endeffector - EndEffector ?part - Part)

		;?endeffectorholder is located in ?changingstation
		(endEffectorHolder-has-physicalLocation-refObject-changingStation ?endeffectorholder - EndEffectorHolder ?endeffectorchangingstation - EndEffectorChangingStation)

		;?kit is held by ?endeffector
		(kit-has-physicalLocation-refObject-endEffector ?kit - Kit ?endeffector - EndEffector)

		;?robot is equipped with ?endeffector
		(robot-has-endEffector ?robot - Robot ?endeffector - EndEffector)
	);End of the predicates section
	(:functions
		;capacity of kits that ?lbwk can have
		(capacity-of-kits-in-lbwk ?largeboxwithkits - LargeBoxWithKits)

		;quantity of kits in ?lbwk
		(quantity-of-kits-in-lbwk ?largeboxwithkits - LargeBoxWithKits)

		;flag set to 0 when a part is not found and to 1 when a part is found
		(part-found-flag)

		;capacity of parts of a certain ?sku that ?kit can have
		(capacity-of-parts-in-kit ?stockkeepingunit - StockKeepingUnit ?kit - Kit)

		;current quantity of parts in ?kit
		(current-quantity-of-parts-in-kit ?kit - Kit)

		;quantity of parts in ?partsTray
		(quantity-of-parts-in-partstray ?partstray - PartsTray)

		;quantity of kit trays in ?lbwekt
		(quantity-of-kittrays-in-lbwekt ?largeboxwithemptykittrays - LargeBoxWithEmptyKitTrays)

		;quantity of parts with ?sku in ?kit
		(quantity-of-parts-in-kit ?stockkeepingunit - StockKeepingUnit ?kit - Kit)

		;final quantity of parts in ?kit
		(final-quantity-of-parts-in-kit ?kit - Kit)
	);End of the functions section

	(:action detach-endEffector
		:parameters(
			?robot - Robot
			?endeffector - EndEffector
			?endeffectorholder - EndEffectorHolder
			?endeffectorchangingstation - EndEffectorChangingStation)
		:precondition(and
			(endEffector-has-no-heldObject ?endeffector)
			(endEffectorChangingStation-has-endEffectorHolder ?endeffectorchangingstation ?endeffectorholder)
			(endEffectorHolder-has-physicalLocation-refObject-changingStation ?endeffectorholder ?endeffectorchangingstation)
			(endEffector-has-physicalLocation-refObject-robot ?endeffector ?robot)
			(robot-has-endEffector ?robot ?endeffector))
		:effect(and
			(endEffectorHolder-has-endEffector ?endeffectorholder ?endeffector)
			(not(robot-has-endEffector ?robot ?endeffector))
			(endEffector-has-physicalLocation-refObject-endEffectorHolder ?endeffector ?endeffectorholder)
			(robot-has-no-endEffector ?robot)
			(not(endEffector-has-physicalLocation-refObject-robot ?endeffector ?robot)))
	)
	(:action take-part
		:parameters(
			?robot - Robot
			?part - Part
			?stockkeepingunit - StockKeepingUnit
			?partstray - PartsTray
			?endeffector - EndEffector
			?kit - Kit)
		:precondition(and
			(> (quantity-of-parts-in-partstray ?partstray) 0.000000)
			(endEffector-is-for-partSKU ?endeffector ?stockkeepingunit)
			(endEffector-has-no-heldObject ?endeffector)
			(part-is-found ?part)
			(kit-exists ?kit)
			(robot-has-endEffector ?robot ?endeffector)
			(part-has-physicalLocation-refObject-partsTray ?part ?partstray)
			(partsVessel-has-part ?partstray ?part)
			(part-has-skuObject-sku ?part ?stockkeepingunit)
			(endEffector-has-physicalLocation-refObject-robot ?endeffector ?robot))
		:effect(and
			(decrease (quantity-of-parts-in-partstray ?partstray) 1)
			(not(endEffector-has-no-heldObject ?endeffector))
			(part-has-physicalLocation-refObject-endEffector ?part ?endeffector)
			(not(part-has-physicalLocation-refObject-partsTray ?part ?partstray))
			(endEffector-has-heldObject-part ?endeffector ?part))
	)
	(:action take-kitTray
		:parameters(
			?robot - Robot
			?kittray - KitTray
			?largeboxwithemptykittrays - LargeBoxWithEmptyKitTrays
			?endeffector - EndEffector
			?stockkeepingunit - StockKeepingUnit)
		:precondition(and
			(> (quantity-of-kittrays-in-lbwekt ?largeboxwithemptykittrays) 0.000000)
			(endEffector-is-for-kitTraySKU ?endeffector ?stockkeepingunit)
			(robot-has-endEffector ?robot ?endeffector)
			(endEffector-has-no-heldObject ?endeffector)
			(kitTray-has-physicalLocation-refObject-lbwekt ?kittray ?largeboxwithemptykittrays)
			(kitTray-has-skuObject-sku ?kittray ?stockkeepingunit)
			(endEffector-has-physicalLocation-refObject-robot ?endeffector ?robot))
		:effect(and
			(decrease (quantity-of-kittrays-in-lbwekt ?largeboxwithemptykittrays) 1)
			(not(kitTray-has-physicalLocation-refObject-lbwekt ?kittray ?largeboxwithemptykittrays))
			(kitTray-has-physicalLocation-refObject-endEffector ?kittray ?endeffector)
			(endEffector-has-heldObject-kitTray ?endeffector ?kittray)
			(not(endEffector-has-no-heldObject ?endeffector)))
	)
	(:action place-kitTray
		:parameters(
			?robot - Robot
			?kittray - KitTray
			?worktable - WorkTable
			?endeffector - EndEffector)
		:precondition(and
			(robot-has-endEffector ?robot ?endeffector)
			(endEffector-has-heldObject-kitTray ?endeffector ?kittray)
			(endEffector-has-physicalLocation-refObject-robot ?endeffector ?robot)
			(kitTray-has-physicalLocation-refObject-endEffector ?kittray ?endeffector))
		:effect(and
			(kitTray-has-physicalLocation-refObject-workTable ?kittray ?worktable)
			(not(kitTray-has-physicalLocation-refObject-endEffector ?kittray ?endeffector))
			(not(endEffector-has-heldObject-kitTray ?endeffector ?kittray))
			(endEffector-has-no-heldObject ?endeffector)
			(workTable-has-objectOnTable-kitTray ?worktable ?kittray))
	)
	(:action create-kit
		:parameters(
			?kit - Kit
			?kittray - KitTray
			?worktable - WorkTable)
		:precondition(and
			(kit-has-kitTray ?kit ?kittray)
			(workTable-has-objectOnTable-kitTray ?worktable ?kittray)
			(kitTray-has-physicalLocation-refObject-kit ?kittray ?kit)
			(kitTray-has-physicalLocation-refObject-workTable ?kittray ?worktable))
		:effect(and
			(not(workTable-has-objectOnTable-kitTray ?worktable ?kittray))
			(workTable-has-objectOnTable-kit ?worktable ?kit)
			(kit-has-physicalLocation-refObject-workTable ?kit ?worktable)
			(not(kitTray-has-physicalLocation-refObject-workTable ?kittray ?worktable))
			(kit-exists ?kit))
	)
	(:action attach-endEffector
		:parameters(
			?robot - Robot
			?endeffector - EndEffector
			?endeffectorholder - EndEffectorHolder
			?endeffectorchangingstation - EndEffectorChangingStation)
		:precondition(and
			(endEffectorHolder-has-endEffector ?endeffectorholder ?endeffector)
			(endEffectorChangingStation-has-endEffectorHolder ?endeffectorchangingstation ?endeffectorholder)
			(endEffectorHolder-has-physicalLocation-refObject-changingStation ?endeffectorholder ?endeffectorchangingstation)
			(endEffector-has-physicalLocation-refObject-endEffectorHolder ?endeffector ?endeffectorholder)
			(robot-has-no-endEffector ?robot))
		:effect(and
			(not(endEffector-has-physicalLocation-refObject-endEffectorHolder ?endeffector ?endeffectorholder))
			(not(endEffectorHolder-has-endEffector ?endeffectorholder ?endeffector))
			(not(robot-has-no-endEffector ?robot))
			(robot-has-endEffector ?robot ?endeffector)
			(endEffector-has-physicalLocation-refObject-robot ?endeffector ?robot)
			(endEffector-has-no-heldObject ?endeffector))
	)
	(:action place-kit
		:parameters(
			?robot - Robot
			?kit - Kit
			?endeffector - EndEffector
			?largeboxwithkits - LargeBoxWithKits)
		:precondition(and
			(< (quantity-of-kits-in-lbwk ?largeboxwithkits)  (capacity-of-kits-in-lbwk ?largeboxwithkits) )
			(kit-has-physicalLocation-refObject-endEffector ?kit ?endeffector)
			(robot-has-endEffector ?robot ?endeffector)
			(endEffector-has-heldObject-kit ?endeffector ?kit)
			(endEffector-has-physicalLocation-refObject-robot ?endeffector ?robot))
		:effect(and
			(increase (quantity-of-kits-in-lbwk ?largeboxwithkits) 1)
			(not(endEffector-has-heldObject-kit ?endeffector ?kit))
			(endEffector-has-no-heldObject ?endeffector)
			(not(kit-exists ?kit))
			(kit-has-physicalLocation-refObject-lbwk ?kit ?largeboxwithkits)
			(not(kit-has-physicalLocation-refObject-endEffector ?kit ?endeffector))
			(lbwk-has-kit ?largeboxwithkits ?kit))
	)
	(:action place-part
		:parameters(
			?robot - Robot
			?part - Part
			?stockkeepingunit - StockKeepingUnit
			?kit - Kit
			?endeffector - EndEffector
			?worktable - WorkTable
			?partstray - PartsTray)
		:precondition(and
			(< (quantity-of-parts-in-kit ?stockkeepingunit ?kit)  (capacity-of-parts-in-kit ?stockkeepingunit ?kit) )
			(part-has-skuObject-sku ?part ?stockkeepingunit)
			(part-has-physicalLocation-refObject-endEffector ?part ?endeffector)
			(endEffector-has-heldObject-part ?endeffector ?part)
			(endEffector-has-physicalLocation-refObject-robot ?endeffector ?robot)
			(robot-has-endEffector ?robot ?endeffector)
			(kit-exists ?kit))
		:effect(and
			(increase (current-quantity-of-parts-in-kit ?kit) 1)
			(increase (quantity-of-parts-in-kit ?stockkeepingunit ?kit) 1)
			(increase (part-found-flag) 1)
			(not(endEffector-has-heldObject-part ?endeffector ?part))
			(not(part-has-physicalLocation-refObject-endEffector ?part ?endeffector))
			(part-has-physicalLocation-refObject-kit ?part ?kit)
			(endEffector-has-no-heldObject ?endeffector))
	)
	(:action look-for-part
		:parameters(
			?robot - Robot
			?part - Part
			?stockkeepingunit - StockKeepingUnit
			?kit - Kit
			?endeffector - EndEffector)
		:precondition(and
			(> (part-found-flag) 0.000000)
			(endEffector-is-for-partSKU ?endeffector ?stockkeepingunit)
			(endEffector-has-no-heldObject ?endeffector)
			(part-has-skuObject-sku ?part ?stockkeepingunit)
			(kit-exists ?kit)
			(robot-has-endEffector ?robot ?endeffector)
			(endEffector-has-physicalLocation-refObject-robot ?endeffector ?robot))
		:effect(and
			(decrease (part-found-flag) 1)
			(part-is-found ?part))
	)
	(:action take-kit
		:parameters(
			?robot - Robot
			?kit - Kit
			?kittray - KitTray
			?worktable - WorkTable
			?stockkeepingunit - StockKeepingUnit
			?endeffector - EndEffector)
		:precondition(and
			(= (current-quantity-of-parts-in-kit ?kit)  (final-quantity-of-parts-in-kit ?kit) )
			(endEffector-has-physicalLocation-refObject-robot ?endeffector ?robot)
			(kit-has-kitTray ?kit ?kittray)
			(endEffector-is-for-kitTraySKU ?endeffector ?stockkeepingunit)
			(robot-has-endEffector ?robot ?endeffector)
			(kitTray-has-skuObject-sku ?kittray ?stockkeepingunit)
			(endEffector-has-no-heldObject ?endeffector)
			(kit-exists ?kit))
		:effect(and
			(not(workTable-has-objectOnTable-kit ?worktable ?kit))
			(not(kit-has-physicalLocation-refObject-workTable ?kit ?worktable))
			(not(endEffector-has-no-heldObject ?endeffector))
			(endEffector-has-heldObject-kit ?endeffector ?kit)
			(kit-has-physicalLocation-refObject-endEffector ?kit ?endeffector))
	)
)

; problem
(define (problem kitting-problem)
	(:domain kitting-domain)
	(:objects
		robot_1 - Robot
		changing_station_1 - EndEffectorChangingStation
		kit_tray_1 - KitTray
		kit_1 - Kit
		empty_kit_tray_supply - LargeBoxWithEmptyKitTrays
		finished_kit_receiver - LargeBoxWithKits
		work_table_1 - WorkTable
		part_c_tray part_b_tray part_a_tray - PartsTray
		part_b_1 part_a_2 part_a_1 part_c_1 - Part
		part_gripper tray_gripper - EndEffector
		part_gripper_holder tray_gripper_holder - EndEffectorHolder
		stock_keeping_unit_part_c stock_keeping_unit_part_b stock_keeping_unit_part_a stock_keeping_unit_kit_tray - StockKeepingUnit
	)
	(:init
		(endEffector-has-physicalLocation-refObject-robot tray_gripper robot_1)
		(endEffectorHolder-has-physicalLocation-refObject-changingStation part_gripper_holder changing_station_1)
		(endEffectorHolder-has-physicalLocation-refObject-changingStation tray_gripper_holder changing_station_1)
		(endEffector-has-physicalLocation-refObject-endEffectorHolder part_gripper part_gripper_holder)
		(endEffector-has-no-heldObject tray_gripper)
		(endEffector-is-for-partSKU part_gripper stock_keeping_unit_part_b)
		(endEffector-is-for-partSKU part_gripper stock_keeping_unit_part_a)
		(endEffector-is-for-partSKU part_gripper stock_keeping_unit_part_a)
		(endEffector-is-for-partSKU part_gripper stock_keeping_unit_part_c)
		(endEffectorHolder-has-endEffector part_gripper_holder part_gripper)
		(endEffectorChangingStation-has-endEffectorHolder changing_station_1 part_gripper_holder)
		(endEffectorChangingStation-has-endEffectorHolder changing_station_1 tray_gripper_holder)
		(robot-has-endEffector robot_1 tray_gripper)
		(kit-has-kitTray kit_1 kit_tray_1)
		(partsVessel-has-part  part_c_tray part_c_1)
		(partsVessel-has-part  part_b_tray part_b_1)
		(partsVessel-has-part  part_a_tray part_a_2)
		(partsVessel-has-part  part_a_tray part_a_1)
		(workTable-has-no-objectOnTable work_table_1)
		(kitTray-has-physicalLocation-refObject-lbwekt kit_tray_1 empty_kit_tray_supply)
		(kitTray-has-physicalLocation-refObject-kit kit_tray_1 kit_1)
		(kitTray-has-skuObject-sku kit_tray_1 stock_keeping_unit_kit_tray)
		(part-has-physicalLocation-refObject-partsTray part_b_1 part_b_tray)
		(part-has-physicalLocation-refObject-partsTray part_a_2 part_a_tray)
		(part-has-physicalLocation-refObject-partsTray part_a_1 part_a_tray)
		(part-has-physicalLocation-refObject-partsTray part_c_1 part_c_tray)
		(part-has-skuObject-sku part_b_1 stock_keeping_unit_part_b)
		(part-has-skuObject-sku part_a_2 stock_keeping_unit_part_a)
		(part-has-skuObject-sku part_a_1 stock_keeping_unit_part_a)
		(part-has-skuObject-sku part_c_1 stock_keeping_unit_part_c)
		(endEffector-is-for-kitTraySKU tray_gripper stock_keeping_unit_kit_tray)
		(= (capacity-of-parts-in-kit  stock_keeping_unit_part_c kit_1) 1)
		(= (capacity-of-parts-in-kit  stock_keeping_unit_part_b kit_1) 1)
		(= (capacity-of-parts-in-kit  stock_keeping_unit_part_a kit_1) 2)
		(= (quantity-of-parts-in-kit  stock_keeping_unit_part_b kit_1) 0)
		(= (quantity-of-parts-in-kit  stock_keeping_unit_part_a kit_1) 0)
		(= (quantity-of-parts-in-kit  stock_keeping_unit_part_c kit_1) 0)
		(= (quantity-of-parts-in-partstray  part_c_tray) 1)
		(= (quantity-of-parts-in-partstray  part_b_tray) 1)
		(= (quantity-of-parts-in-partstray  part_a_tray) 2)
		(= (part-found-flag) 1)
		(= (capacity-of-kits-in-lbwk finished_kit_receiver) 12)
		(= (quantity-of-kittrays-in-lbwekt empty_kit_tray_supply) 1)
		(= (quantity-of-kits-in-lbwk finished_kit_receiver) 0)
		(= (current-quantity-of-parts-in-kit kit_1) 0)
		(= (final-quantity-of-parts-in-kit kit_1) 4)
	)
	(:goal
		(and
		(kit-has-physicalLocation-refObject-lbwk kit_1 finished_kit_receiver)
		(lbwk-has-kit finished_kit_receiver kit_1)
		)
	)
)

; plan
1. (take-kittray robot_1 kit_tray_1 empty_kit_tray_supply tray_gripper stock_keeping_unit_kit_tray)
   deleted: (kittray-has-physicallocation-refobject-lbwekt kit_tray_1 empty_kit_tray_supply) (endeffector-has-no-heldobject tray_gripper)
   added: (kittray-has-physicallocation-refobject-endeffector kit_tray_1 tray_gripper) (endeffector-has-heldobject-kittray tray_gripper kit_tray_1)
   changed: (quantity-of-kittrays-in-lbwekt empty_kit_tray_supply) from 1 to 0
   goals met: 0 of 2
2. (place-kittray robot_1 kit_tray_1 work_table_1 tray_gripper)
   deleted: (kittray-has-physicallocation-refobject-endeffector kit_tray_1 tray_gripper) (endeffector-has-heldobject-kittray tray_gripper kit_tray_1)
   added: (kittray-has-physicallocation-refobject-worktable kit_tray_1 work_table_1) (endeffector-has-no-heldobject tray_gripper) (worktable-has-objectontable-kittray work_table_1 kit_tray_1)
   goals met: 0 of 2
3. (create-kit kit_1 kit_tray_1 work_table_1)
   deleted: (worktable-has-objectontable-kittray work_table_1 kit_tray_1) (kittray-has-physicallocation-refobject-worktable kit_tray_1 work_table_1)
   added: (worktable-has-objectontable-kit work_table_1 kit_1) (kit-has-physicallocation-refobject-worktable kit_1 work_table_1) (kit-exists kit_1)
   goals met: 0 of 2
4. (detach-endeffector robot_1 tray_gripper part_gripper_holder changing_station_1)
   deleted: (robot-has-endeffector robot_1 tray_gripper) (endeffector-has-physicallocation-refobject-robot tray_gripper robot_1)
   added: (endeffectorholder-has-endeffector part_gripper_holder tray_gripper) (endeffector-has-physicallocation-refobject-endeffectorholder tray_gripper part_gripper_holder) (robot-has-no-endeffector robot_1)
   goals met: 0 of 2
5. (attach-endeffector robot_1 part_gripper part_gripper_holder changing_station_1)
   deleted: (endeffector-has-physicallocation-refobject-endeffectorholder part_gripper part_gripper_holder) (endeffectorholder-has-endeffector part_gripper_holder part_gripper) (robot-has-no-endeffector robot_1)
   added: (robot-has-endeffector robot_1 part_gripper) (endeffector-has-physicallocation-refobject-robot part_gripper robot_1) (endeffector-has-no-heldobject part_gripper)
   goals met: 0 of 2
6. (look-for-part robot_1 part_a_2 stock_keeping_unit_part_a kit_1 part_gripper)
   added: (part-is-found part_a_2)
   changed: (part-found-flag) from 1 to 0
   goals met: 0 of 2
7. (take-part robot_1 part_a_2 stock_keeping_unit_part_a part_a_tray part_gripper kit_1)
   deleted: (endeffector-has-no-heldobject part_gripper) (part-has-physicallocation-refobject-partstray part_a_2 part_a_tray)
   added: (part-has-physicallocation-refobject-endeffector part_a_2 part_gripper) (endeffector-has-heldobject-part part_gripper part_a_2)
   changed: (quantity-of-parts-in-partstray part_a_tray) from 2 to 1
   goals met: 0 of 2
8. (place-part robot_1 part_a_2 stock_keeping_unit_part_a kit_1 part_gripper work_table_1 part_a_tray)
   deleted: (endeffector-has-heldobject-part part_gripper part_a_2) (part-has-physicallocation-refobject-endeffector part_a_2 part_gripper)
   added: (part-has-physicallocation-refobject-kit part_a_2 kit_1) (endeffector-has-no-heldobject part_gripper)
   changed: (current-quantity-of-parts-in-kit kit_1) from 0 to 1, (quantity-of-parts-in-kit stock_keeping_unit_part_a kit_1) from 0 to 1, (part-found-flag) from 0 to 1
   goals met: 0 of 2
9. (look-for-part robot_1 part_a_1 stock_keeping_unit_part_a kit_1 part_gripper)
   added: (part-is-found part_a_1)
   changed: (part-found-flag) from 1 to 0
   goals met: 0 of 2
10. (take-part robot_1 part_a_1 stock_keeping_unit_part_a part_a_tray part_gripper kit_1)
   deleted: (endeffector-has-no-heldobject part_gripper) (part-has-physicallocation-refobject-partstray part_a_1 part_a_tray)
   added: (part-has-physicallocation-refobject-endeffector part_a_1 part_gripper) (endeffector-has-heldobject-part part_gripper part_a_1)
   changed: (quantity-of-parts-in-partstray part_a_tray) from 1 to 0
   goals met: 0 of 2
11. (place-part robot_1 part_a_1 stock_keeping_unit_part_a kit_1 part_gripper work_table_1 part_c_tray)
   deleted: (endeffector-has-heldobject-part part_gripper part_a_1) (part-has-physicallocation-refobject-endeffector part_a_1 part_gripper)
   added: (part-has-physicallocation-refobject-kit part_a_1 kit_1) (endeffector-has-no-heldobject part_gripper)
   changed: (current-quantity-of-parts-in-kit kit_1) from 1 to 2, (quantity-of-parts-in-kit stock_keeping_unit_part_a kit_1) from 1 to 2, (part-found-flag) from 0 to 1
   goals met: 0 of 2
12. (look-for-part robot_1 part_b_1 stock_keeping_unit_part_b kit_1 part_gripper)
   added: (part-is-found part_b_1)
   changed: (part-found-flag) from 1 to 0
   goals met: 0 of 2
13. (take-part robot_1 part_b_1 stock_keeping_unit_part_b part_b_tray part_gripper kit_1)
   deleted: (endeffector-has-no-heldobject part_gripper) (part-has-physicallocation-refobject-partstray part_b_1 part_b_tray)
   added: (part-has-physicallocation-refobject-endeffector part_b_1 part_gripper) (endeffector-has-heldobject-part part_gripper part_b_1)
   changed: (quantity-of-parts-in-partstray part_b_tray) from 1 to 0
   goals met: 0 of 2
14. (place-part robot_1 part_b_1 stock_keeping_unit_part_b kit_1 part_gripper work_table_1 part_b_tray)
   deleted: (endeffector-has-heldobject-part part_gripper part_b_1) (part-has-physicallocation-refobject-endeffector part_b_1 part_gripper)
   added: (part-has-physicallocation-refobject-kit part_b_1 kit_1) (endeffector-has-no-heldobject part_gripper)
   changed: (current-quantity-of-parts-in-kit kit_1) from 2 to 3, (quantity-of-parts-in-kit stock_keeping_unit_part_b kit_1) from 0 to 1, (part-found-flag) from 0 to 1
   goals met: 0 of 2
15. (look-for-part robot_1 part_c_1 stock_keeping_unit_part_c kit_1 part_gripper)
   added: (part-is-found part_c_1)
   changed: (part-found-flag) from 1 to 0
   goals met: 0 of 2
16. (take-part robot_1 part_c_1 stock_keeping_unit_part_c part_c_tray part_gripper kit_1)
   deleted: (endeffector-has-no-heldobject part_gripper) (part-has-physicallocation-refobject-partstray part_c_1 part_c_tray)
   added: (part-has-physicallocation-refobject-endeffector part_c_1 part_gripper) (endeffector-has-heldobject-part part_gripper part_c_1)
   changed: (quantity-of-parts-in-partstray part_c_tray) from 1 to 0
   goals met: 0 of 2
17. (place-part robot_1 part_c_1 stock_keeping_unit_part_c kit_1 part_gripper work_table_1 part_a_tray)
   deleted: (endeffector-has-heldobject-part part_gripper part_c_1) (part-has-physicallocation-refobject-endeffector part_c_1 part_gripper)
   added: (part-has-physicallocation-refobject-kit part_c_1 kit_1) (endeffector-has-no-heldobject part_gripper)
   changed: (current-quantity-of-parts-in-kit kit_1) from 3 to 4, (quantity-of-parts-in-kit stock_keeping_unit_part_c kit_1) from 0 to 1, (part-found-flag) from 0 to 1
   goals met: 0 of 2
18. (detach-endeffector robot_1 part_gripper part_gripper_holder changing_station_1)
   deleted: (robot-has-endeffector robot_1 part_gripper) (endeffector-has-physicallocation-refobject-robot part_gripper robot_1)
   added: (endeffectorholder-has-endeffector part_gripper_holder part_gripper) (endeffector-has-physicallocation-refobject-endeffectorholder part_gripper part_gripper_holder) (robot-has-no-endeffector robot_1)
   goals met: 0 of 2
19. (attach-endeffector robot_1 tray_gripper part_gripper_holder changing_station_1)
   deleted: (endeffector-has-physicallocation-refobject-endeffectorholder tray_gripper part_gripper_holder) (endeffectorholder-has-endeffector part_gripper_holder tray_gripper) (robot-has-no-endeffector robot_1)
   added: (robot-has-endeffector robot_1 tray_gripper) (endeffector-has-physicallocation-refobject-robot tray_gripper robot_1)
   goals met: 0 of 2
20. (take-kit robot_1 kit_1 kit_tray_1 work_table_1 stock_keeping_unit_kit_tray tray_gripper)
   deleted: (worktable-has-objectontable-kit work_table_1 kit_1) (kit-has-physicallocation-refobject-worktable kit_1 work_table_1) (endeffector-has-no-heldobject tray_gripper)
   added: (endeffector-has-heldobject-kit tray_gripper kit_1) (kit-has-physicallocation-refobject-endeffector kit_1 tray_gripper)
   goals met: 0 of 2
21. (place-kit robot_1 kit_1 tray_gripper finished_kit_receiver)
   deleted: (endeffector-has-heldobject-kit tray_gripper kit_1) (kit-exists kit_1) (kit-has-physicallocation-refobject-endeffector kit_1 tray_gripper)
   added: (endeffector-has-no-heldobject tray_gripper) (kit-has-physicallocation-refobject-lbwk kit_1 finished_kit_receiver) (lbwk-has-kit finished_kit_receiver kit_1)
   changed: (quantity-of-kits-in-lbwk finished_kit_receiver) from 0 to 1
   goals met: 2 of 2
